In [10]:
# Filter
import numpy as np
import pandas as pd

In [11]:
a1 = [60, 84, 80, 70,'문예부']
a2 = [77, 62, 95, 85,'과학부']
a3 = [61, 97, 72, np.nan,'농구부']
a4 = [75, 65, 95, np.nan,'다도부']
cols = ['국어', '영어', '수학', '과학', '소속']
b1 = ['문예부', '과학부', '다도부']
df = pd.DataFrame([a1, a2, a3, a4], index=list('ABCD'), columns=cols)
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [12]:
# Series or DataFrame을 조건식으로 True/False로 만들어 True값을 갖는 Data만 추출한다.

In [13]:
cond1 = df['국어'] > 60
cond2 = df['수학'] > 75
# conditional은 Boolean값을 생성한다 대상이 Series면 Boolean Series, 
df.loc[cond1 & cond2]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [14]:
df.loc[df['과학'].isnull()]

   국어  영어  수학  과학   소속
C  61  97  72 NaN  농구부
D  75  65  95 NaN  다도부

In [17]:
df.loc[(~df['과학'].isnull()) & (df['수학'] > 90)]
# & , |는 괄호를 사용하여 구분하여 주어야 한다.     🔰

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부

In [18]:
df.loc[df['소속'].isin(['문예부', '다도부'])]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
D  75  65  95   NaN  다도부